const data = {
    "নামাজ": {
        "নম্বরভিত্তিক": {
            "ফরজ ৬টি": "পরিপূর্ণ ও প্রাণবন্ত নামাজে অসংখ্য বিধি-বিধান আছে। সেগুলোর কোনোটি ফরজ, কোনোটি ওয়াজিব, কোনোটি সুন্নত এবং কোনোটি মুস্তাহাব। এখানে নামাজের ভেতরের ফরজ কাজগুলো আলোচনা করা হলো— ১.   তাকবিরে তাহরিমা, অর্থাৎ শুরুতে আল্লাহু আকবার বলা। (সুরা : মুদ্দাসসির, আয়াত : ৩; বুখারি, হাদিস : ৮৩৩; মুসলিম, হাদিস : ৪১১, ৪১২) ২.   ফরজ ও ওয়াজিব নামাজ দাঁড়িয়ে পড়া।(সুরা : বাকারা, আয়াত : ২৩৮; বুখারি, হাদিস : ১১১৭)৩.   কিরাত পড়া (অর্থাৎ কোরআন শরিফ থেকে ন্যূনতম ছোট এক আয়াত পরিমাণ পড়া ফরজ।) (সুরা : মুজ্জাম্মিল, আয়াত ২০; বুখারি, হাদিস :৬২৫১; তিরমিজি, ৬৭, হাদিস : ৩০২, ৩০৩)৪.   রুকু করা। (সুরা : হজ, আয়াত ৭৭; বুখারি, হাদিস : ১১১৩, ১১১৪; মুসলিম, হাদিস : ৪১২)৫.   দুই সিজদা করা। (সুরা : হজ, আয়াত ৭৭; বুখারি, হাদিস : ৭৩৩; মুসলিম, হাদিস : ৪১১)৬.   শেষ বৈঠক (নামাজের শেষে তাশাহহুদ পরিমাণ বসা) (আবু দাউদ, হাদিস : ৯৭০)বি. দ্র. : নামাজি ব্যক্তির নিজস্ব কোনো কাজের মাধ্যমে (যেমন—সালাম ফেরানো ইত্যাদি) নামাজ থেকে বের হওয়াও একটা ফরজভুক্ত।(আল বাহরুর রায়িক, ১ : ৫১৩)। নামাজের কোনো ফরজ বাদ পড়লে নামাজ বাতিল হয়ে যায়। সাহু সিজদা করলেও নামাজ সহিহ হয় না। (আল বাহরুররায়িক, ১/৫০৫; ফাতাওয়া শামি, ১/৪৪৭; হিদায়া : ১/৯৮)",
            "সুন্নত ৫২টি": {
                "দাঁড়ানো অবস্থায় ১১টি সুন্নাত।": "দাঁড়ানো অবস্থায় ১১টি সুন্নাত। * তাকবিরে তাহরিমার সময় সোজা হয়ে দাঁড়ানো; অর্থাৎ মাথা ঝুঁকাবে না। (আল-বাহরুর রায়েক-খণ্ড ১, পৃ. ৩০২) সিজদার স্থানে দৃষ্টি রাখা। (আল-বাহরুর রায়েক-খ. ১, পৃ. ৩০৪) উভয় পায়ের মাঝে চার আঙুল পরিমাণ ফাঁক রাখা এবং পায়ের আঙুল কিবলার দিকে রাখা। (ফাতহুল কাদির-খ. ১, পৃ. ২৫৮) । * মুক্তাদির তাকবিরে তাহরিমা ইমামের সঙ্গে হওয়া (বাদাইউস সানায়ে'-খ. ১, পৃ. ২০০) । * তাকবিরে তাহরিমার সময় উভয় হাত কান পর্যন্ত উঠানো। (বাদাইউস সানায়ে'-খ. ১, পৃ. ১৯৯) * হাতের তালু কিবলার দিকে রাখা (আল-বাহরুর রায়েক-খ. ১, পৃ. ৩০২) * আঙুলগুলোকে স্বাভাবিক রাখা; অর্থাৎ একেবারে খোলাও রাখবে না, আবার বন্ধও করে রাখবে না। (আদদুররুল মুখতার-খ, ১, পৃ. 474 ১২৩৪৫৬৭৮৯০) * ডান হাতের তালু বাঁ হাতের পিঠের ওপর রাখবে। (ফতোয়া তাতারখানিয়া-খ. ১, পৃ. ৫৩১) * কনিষ্ঠ ও বৃদ্ধাঙ্গুলি দ্বারা হালকা বাঁকিয়ে কবজিকে ধরা। (ফতোয়া হিন্দিয়া-খ. ১, পৃ. ৭৩) * বাকি তিন আঙুল হাতের ওপর বিছিয়ে দেওয়া। * নাভির নিচে হাত বাঁধা (তাবেইনুল হাকাইক-খ. ১, পৃ. ১০৭) * সানা পড়া (হিদায়াহ্-খ. ১, পৃ. ১০২)",

                "কিরাতের সুন্নাত ৭টি": "কিরাতের সুন্নাত ৭টি * তা'আউজ অর্থাৎ আউযুবিল্লাহ পড়া। (বাদাইউস সানায়ে'-খ. ১, পৃ. ২০২) * তাসমিয়া অর্থাৎ বিসমিল্লাহ পড়া। (আল বাহরুর রায়েক-খ. ১, পৃ. ৩১২ * চুপে চুপে আমিন বলা। (আল ফিক্বহ আলাল মাজাহিবিল আরবাআ-খ. ১, পৃ. ২৫০) মাগরিব নামাজে 'কিসারে মুফাস্সল' অর্থাৎ সুরায়েযিলযাল থেকে সুরায়ে নাস পর্যন্ত সুরাগুলোর মধ্যে যেকোনো একটি পড়া। (হিদায়া-খ. ১, পৃ. ১১৯) আল-বাহরুর রায়েক-খ. ১, পৃ. ৩৪০) * ফজরের প্রথম রাকাত দীর্ঘ করা। (বাদাইউস সানায়ে'-খ. ১, পৃ. ২০৬) * মধ্যম গতিতে পড়া; অর্থাৎ খুব দ্রুতও নয় আবার বেশি ধীরেও নয়। (ফতোয়া তাতারখানিয়া-খ. ১, পৃ. ৪৫৬) * ফরজ নামাজের তৃতীয় ও চতুর্থ রাকাতে শুধু সুরায়ে ফাতিহা পড়া। (হিদায়া-খ. ১, পৃ. ১১১)",

                "রুকুর সুন্নত ৮টি": "রুকুর সুন্নত ৮টি * রুকুতে তাকবির বলা (বাদাইউস সানায়ে'-খ. ১, পৃ. ২০৭ * রুকুতে উভয় হাত হাঁটুতে ধরা। (আল-বাহরুর রায়েক-খ. ১, পৃ. ৩১৫ * হাঁটু ধরার সময় আঙুলগুলোকে ফাঁক করে রাখা। (হিদায়া-খ. ১, পৃ. ১০৬) * পায়ের গোছাকে সোজা রাখা। (আল ফিক্হ আলাল মাজাহিবিল আরবাআ-খ. ১, পৃ. ২৫৮) * পিঠকে বিছিয়ে দেওয়া। (বাদাইউস সানায়ে'-খ. ১, পৃ. ২০৮) * মাথা ও নিতম্বকে বরাবর রাখা। (বাদাইউস সানায়ে'-খ. ১, পৃ. ২০৮) * রুকুতে কমপক্ষে তিনবার 'সুবহানা রাব্বিয়াল আজিম' পড়া। (হিদায়া-খ. ১, পৃ. ১০৬) * রুকু থেকে উঠার সময় ইমামের 'সামিআল্লাহু লিমান হামিদাহ' বলা, মুক্তাদির 'রাব্বানা লাকাল হামদ্' বলা। (আল বাহরুর রায়েক-খ. ১, পৃ. ৩১৬)",

                "সিজদার সুন্নাত ১২টি": "সিজদার সুন্নাত ১২টি * সিজদার তাকবির বলা। (আল ফিকহ আলাল মাজাহিবিল আরবাআ-খ. ১, পৃ. ২৪২) * সিজদায় প্রথমে উভয় হাঁটু রাখা। (আল বাহরুর রায়েক-খ. ১, পৃ. ৩১৭) * তারপর উভয় হাত রাখা। (আল বাহরুর রায়েক-খ. ১, পৃ. ৩১৭) * তারপর নাক রাখা। (আল বাহরুর রায়েক-খ. ১, পৃ. ৩১৭) * তারপর কপাল রাখা। (আল বাহরুর রায়েক-খ. ১, পৃ. ৩১৭) * উভয় হাতের মাঝে সিজদা করা (আসসি'আয়াহ-খ. ২, পৃ. ১৯৫) * সিজদায় পেটকে ঊরু থেকে পৃথক রাখা। (আল বাহরুর রায়েক-খ. ১, পৃ. ৩২০) * বাহুদ্বয়কে বগল থেকে পৃথক রাখা। (আল বাহরুর রায়েক-খ. ১, পৃ. ৩২০) * কনুইকে জমিন থেকে পৃথক রাখা। (আল ফিকহুল ইসলামী-খ. ১, পৃ. 707  ৭০৭) * সিজদায় কমপক্ষে তিনবার 'সুবহানা রাব্বিয়াল আ'লা' পড়া (সিআয়াত-খ. ১, পৃ. ১৯৮) * সিজদা থেকে উঠার সময় তাকবির বলা। (বাদাইউস সানায়ে'-খ. ১, পৃ. ২১০) * সিজদা থেকে উঠার সময় প্রথমে কপাল, তারপর নাক, তারপর দুই হাত, তারপর হাঁটু উঠানো এবং উভয় সিজদার মাঝে স্থিরভাবে বসা। (আল বাহরুর রায়েক-খ. ১, পৃ. ১১৭)",

                "বসার সুন্নাত ১৩টি": "বসার সুন্নাত ১৩টি * ডান পা খাড়া রাখা, বাঁ পা বিছিয়ে তার ওপর বসা, উভয় পায়ের আঙুলকে যথাসম্ভব কিবলামুখী রাখা। (আল বাহরুর রায়েক-খ. ১, পৃ. ৩২৩)* উভয় হাত ঊরুর ওপর রাখা। (আল বাহরুর রায়েক-খ. ১, পৃ. ৩২৩)* তাশাহ্হুদের মধ্যে 'আশহাদু আল্লা ইলাহা'-এর ওপর শাহাদাত আঙুলকে ওপরের দিকে উঁচু করা এবং 'ইল্লাল্লাহু' বলার সময় ঝুঁকিয়ে দেওয়া।(রদ্দুল মুহতার-খ. ১, পৃ. ৫০৮)* শেষ বৈঠকে দরুদ শরিফ পড়া। (বাদাইউস সানায়ে'-খ. ১, পৃ. ২১৩)* দরুদ শরিফের পর দোয়ায়ে মাসুরা পড়া। (বাদাইউস সানায়ে'-খ. ১, পৃ. ৭১২)* উভয় দিকে সালাম ফিরানো। (আল ফিক্বহুল ইসলামী-খ. ১, পৃ. ৭২৪)* সালামকে ডান দিকে থেকে আরম্ভ করা। (বাদাইউস সানায়ে'-খ. ১, পৃ. ২১৪)* ইমামের সালামে ফিরিশতা, নেককার জিন ও ডান-বামে মুক্তাদিদের নিয়ত করা। (আল বাহরুর রায়েক-খ. ১, পৃ. ৩৩২)* মুক্তাদিদের সালামে ইমাম, ফিরিশতাগণ, নেককার জিনদের ও ডান-বামের মক্তাদিদের নিয়ত করা। (আল ফিকহ আলাল মাজাহিবিল আরবাআ-খ. ১, পৃ.২৪৩)* একাকী নামাজির কেবল ফিরিশতাদের নিয়ত করা। (আল বাহরুর রায়েক-খ. ১, পৃ. ৩৩৩)* মুক্তাদিদের ইমামের সঙ্গে সঙ্গে সালাম ফিরানো। (বাদাইউস সানায়ে'-খ. ১, পৃ. ২২৪)* দ্বিতীয় সালামের আওয়াজকে প্রথম সালামের তুলনায় নিচু করা। (আল বাহরুর রায়েক-খ. ১, পৃ. ৩৩২)* মাসবুকের (যার নামাজের শুরুতে কিছু ছুটে গেছে) ইমামের ফারেগ হওয়ার অপেক্ষা করা। (আল ফিকহুল ইসলামী-খ. ১, পৃ. ৭২৬)উল্লেখ্য, রুকুতে হাতের আঙুল ছড়িয়ে সিজদায় মিলিয়ে বাকি আরকানে স্বাভাবিক অবস্থায় থাকবে।(দুররুল মুখতার ৩২৬/১, বাহরুর রায়েক ২৯৫/১)"
            }
        },
        "রাকাত সংখ্যা সম্পর্কিত": {
            "ফজর": "২+২",
            "যোহর": "৪+৪+২",
            "আসর": "৪",
            "মাগরিব": "৩+২",
            "ইশা": "৪+২+৩"
        },
        "ভুল": {
            "প্রথম বৈঠকে": {
                "বসিনি": {
                    "সেজদায়ে সাহু দিয়েছেন": {
                        "হ্যাঁ": "নামাজ হয়েছে",
                        "না": "নামাজ হয়নি"
                    }
                }
            },
            "শেষ বৈঠকে": {
                "বসিনি": {
                    "৫ রাকাত পুরা করেছেন": {
                        "না (৫ম রাকাতের রুকুর দেইনি, দাঁড়ানো থেকে বসে গেছি)": {
                            "সেজদায়ে সাহু দিয়েছেন": {
                                "হ্যাঁ": "নামাজ হয়েছে",
                                "না": "নামাজ হয়নি"
                            }
                        },
                        "হ্যাঁ (৫ম রাকাতের রুকু দিয়ে ফেলেছি বা আরো আগে চলে গেছি)": "আপনার ৬ রাকাত নফল হয়ে গেছে। ঐ ফরয নামাজ আবার আদায় করুন / কাযা করুন "
                    }
                },
                "বসে পরে ৫ম রাকাতে দাঁড়িয়ে গেছি": {
                    "৫ম ও ৬ষ্ঠ রাকাত পুরা করেন বা না করেন, সেজদায়ে সাহু দিয়েছেন": {
                        "হ্যাঁ": "নামাজ হয়েছে",
                        "না": "নামাজ হয়নি"
                    }
                },
            },
            "নামাজের কোনো রাকাতে আমি ৩ সেজদায় দিয়েছি": {
                "সেজদায়ে সাহু দিয়েছেন": {
                    "হ্যাঁ": "নামাজ হয়েছে",
                    "না": "নামাজ হয়নি"
                }
            }
        },

    },
    "রোজা": {
        "ভাঙ্গা": {
            "ইচ্ছা করে বমি": "ভেঙ্গে গেছে",
            "অনিচ্ছায় বমি": "ভাঙ্গেনি",
            "চোখের ড্রপ": "ভাঙ্গেনি",
            "কানের ড্রপ": "ভেঙ্গে গেছে/ভাঙ্গেনি",
            "সাপোজিটরি": "ভেঙ্গে গেছে",
            "ইঞ্জেকশন": "ভাঙ্গেনি",
            "রক্ত দান": "ভাঙ্গেনি",
            "রক্ত গ্রহণ": "ভাঙ্গেনি",
            "স্যালাইন গ্রহণ": "ভাঙ্গেনি",
            "ইনহেলার": "ভেঙ্গে গেছে"
        },
        "কাযা": {
            "ভেঙ্গে ফেলেছি": {
                "খেয়ে, পান করে বা সহবাস করে": "কাযা ও ৬০ রোযা লাগাতার রেখে কাফফারা।",
                "অন্য কোনোভাবে বা বৈধ ওজরে": "শুধু কাযা রাখতে হবে"
            },
            "কাযা না রেখে কি শাওয়ালের বা অন্য কোনো নফল রোযা রাখা যাবে?": "যাবে। তবে কাযা আরো আগে রাখা উচিত।"
        },
        "সফর": {
            "বিমানের আরামদায়ক সফরে মুসাফির হিসেবে রোজা না রাখা": "আরামদায়ক হওয়া সত্ত্বেও না রাখার অনুমতি আছে",
            "সফরে রোজা রাখিনি, ইফতারের আগে ফিরে এসেছি": "বাকি দিন না খেয়ে থাকা উচিত"
        }
    },
    "যাকাত":{
        "নেসাব": "এত টাকা",
        "কে নেবে": "৭ প্রকার মানুষ",
        "সোনার যাকাত":"এভাবে",
        "রূপার যাকাত": "ওভাবে",
        "সোনা+রুপা+টাকা": "সেভাবে",
        "ঋণ থাকলে": "হাহা",
        "হারিয়ে যাওয়া মাল ফিরে পেলে": "শেষ বছরের",
        "৬ মাসের জন্য নেয়ার ঋণ ৩ বছর পর দিলে": "এভাবে দেবে হাহা",
        "গবাদি পশু":{
            "উট":{
                "৫": "১টি বকরি",
                "১০": "২টি বকরি"
            },
            "গরু": {
                "৪০টাতে": "১টি অমুক"
            },
            "ছাগল/ভেড়া": {
                "১২০টাতে":"এতটা"
            }
        }
    },
    "হজ্ব": {
        "কার উপর ওয়াজিব": "অমুকের উপর",
        "ফরজ কয়টি": "৩টি। ইহরাম। তওয়াফ। সায়ী",
        "ওয়াজিব": "৫টি। এই করা সেই করা",
        "দম দেয়া": {
            "আতর মাখলে": "sss",
            "নখ কাটলে": "fdf",
            "শিকার করলে": "dsff"
        }
    }
}


export default data;
